
*** Script.py

#+begin_src python :results output
  import matplotlib.pyplot as plt
  import numpy as np
  from sklearn import datasets

  iris = datasets.load_iris()

  samples = iris.data

  x = samples[:, 0]
  y = samples[:, 1]

  # Number of clusters
  k = 3

  # X coordinates of random centroids
  centroids_x = np.random.uniform(min(x), max(x), size=k)

  centroids_y = np.random.uniform(min(y), max(y), size=k)

  # Create centroids array
  centroids = np.array(list(zip(centroids_x, centroids_y)))

  print(centroids)

  # Make a scatter plot of y and x
  plt.scatter(x, y, alpha=0.5)

  # Make a scatter plot of centroids_y, centroid_x
  plt.scatter(centroids_x, centroids_y)

  plt.xlabel('sepal length (cm)')
  plt.ylabel('sepal width (cm)')

  plt.show()

#+end_src

#+RESULTS:
: [[4.89566089 3.01716756]
:  [6.97357791 2.47696023]
:  [6.23522749 2.62739094]]
